//***************************************************************************************
// FileName：IVBF_Tool.h
// Function：工具处理接口。
//           系统主控调用每个组件的该接口来完成交互工具的处理。
//           每个交互工具，通过鼠标键盘事件完成对于对应功能。
// Author:   武玉国
// Date:     2006-4-22
//***************************************************************************************

#ifndef __IVBF_TOOL_H__
#define __IVBF_TOOL_H__


class IVBF_PropertySet;


class IVBF_Tool
{
public:
	virtual ~IVBF_Tool() {}

public:

	//---------------------------------------------------------------
	// 指定的交互工具被选中。
	// szToolID ：交互工具ID。
	// pInParam ：输入参数，具体含义有交互工具本身决定。
	// return 0表示不成功，其它值表示成功。
	//---------------------------------------------------------------
	virtual int OnToolSelected(const char* szToolID, IVBF_PropertySet* pInParam) = 0;

	//---------------------------------------------------------------
	// 指定的交互工具被撤销选中。
	// szToolID ：交互工具ID。
	// pOutParam ：输出参数，具体含义有交互工具本身决定。
	// return 0表示不成功，其它值表示成功。
	//---------------------------------------------------------------
	virtual int OnToolUnSelected(const char* szToolID, IVBF_PropertySet* pOutParam) = 0;

	//---------------------------------------------------------------
	// 获取组件支持的交互工具数目。
	//---------------------------------------------------------------
	virtual int GetToolCount() = 0;

	//---------------------------------------------------------------
	// 获取组件所支持的指定交互工具ID，与次序无关。
	// nIndex ：交互工具的索引号。
	//---------------------------------------------------------------
	virtual const char* GetToolID(int nIndex) = 0;

	//---------------------------------------------------------------
	// 获取右键菜单的名称。
	// 根据交互工具的不同右键菜单的名称可以不同，每个名称对应于一个资源文件。
	// return 右键菜单的名称，如果返回""，表示没有右键菜单。
	//---------------------------------------------------------------
	virtual const char* GetContextMenuName() = 0;
};



#endif