//***************************************************************************************
// FileName：IVBF_Message.h
// Function：消息响应接口。
//           每个组件如果需要响应其他组件发出的消息，就要实现该接口。
// Author:   武玉国
// Date:     2006-4-22
//***************************************************************************************

#ifndef __IVBF_MESSAGE_H__
#define __IVBF_MESSAGE_H__


class IVBF_Message
{
public:
	virtual ~IVBF_Message() {}

public:

	//---------------------------------------------------------------
	// GetMessageCount:获取该组件相应的消息数。
	// return 组件相应的消息数。
	//---------------------------------------------------------------
	virtual int GetMessageCount() = 0;

	//---------------------------------------------------------------
	// 获取指定消息ID，与次序无关。
	// nIndex ：消息ID索引号，用于遍历所有消息。
	// return 消息ID。
	//---------------------------------------------------------------
	virtual const char* GetMessageID(int nIndex) = 0;

	//---------------------------------------------------------------
	// OnMessage:响应消息。
	// szMessage ：消息ID。
	// nValue，pValue ：消息的参数，具体含义有消息本身决定。
	//---------------------------------------------------------------
	virtual void OnMessage(void* pSender,const char* szMessage, int nValue, void* pValue) = 0;

	//---------------------------------------------------------------
	// 订购消息 (杜莹添加：2006-5-8)
	//---------------------------------------------------------------
	virtual void SubscribeMessage() = 0;
};

#endif
