//**********************************************************************************
// 文件名：  VBF_PublicTypes.h
// 描述：    公共数据类型
// 作者:     杜莹
// 日期:     2013-06-25
//**********************************************************************************

#ifndef __VBF_PUBLIC_TYPES_H__
#define __VBF_PUBLIC_TYPES_H__


//---------------------------------------------------------
// 定义枚举：EVBF_CASESENSITIVITY
// 枚举描述：是否区分大小写
//---------------------------------------------------------
enum EVBF_CASESENSITIVITY
{
    VBF_CASE_SENSITIVE,
    VBF_CASE_INSENSITIVE
};


#endif
